SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

--
-- 資料表格式： `apply`
--

CREATE TABLE IF NOT EXISTS `apply` (
  `applyNo` int(11) NOT NULL AUTO_INCREMENT,
  `wishNo` int(11) unsigned NOT NULL,
  `plannerNo` int(3) unsigned zerofill NOT NULL,
  `w_status` int(1) NOT NULL,
  `e_timeLimit` int(15) NOT NULL,
  PRIMARY KEY (`applyNo`),
  KEY `FK_WISHNO` (`wishNo`),
  KEY `FK_PLANNERNO` (`plannerNo`)
) ENGINE = InnoDB DEFAULT CHARSET = utf8;

--
-- 列出以下資料庫的數據： `apply`
--

INSERT INTO `apply` (`applyNo`, `wishNo`, `plannerNo`, `w_status`, `e_timeLimit`) VALUES
(1, 9, 001, 0, 3);

-- --------------------------------------------------------

--
-- 資料表格式： `member`
--

CREATE TABLE IF NOT EXISTS `member` (
  `memberNo` int(3) unsigned zerofill NOT NULL AUTO_INCREMENT,
  `nickName` varchar(10) DEFAULT NULL,
  `memId` varchar(255) NOT NULL,
  `memPsw` varchar(15) DEFAULT NULL,
  `sexuality` char(1) DEFAULT NULL,
  `m_phone` varchar(255) DEFAULT NULL,
  `m_pic` varchar(255) NOT NULL DEFAULT 'm_pic.png',
  PRIMARY KEY (`memberNo`),
  UNIQUE KEY `memId` (`memId`)
) ENGINE = MyISAM DEFAULT CHARSET = utf8;

--
-- 列出以下資料庫的數據： `member`
--

INSERT INTO `member` (`memberNo`, `nickName`, `memId`, `memPsw`, `sexuality`, `m_phone`, `m_pic`) VALUES
(001, 'Rick', 'rick', '111', '0', '0912345678', 'm_pic170531103312.jpg');

-- --------------------------------------------------------

--
-- 資料表格式： `planner`
--

CREATE TABLE IF NOT EXISTS `planner` (
  `plannerNo` int(3) unsigned zerofill NOT NULL AUTO_INCREMENT,
  `memberNo` int(3) unsigned zerofill NOT NULL,
  PRIMARY KEY (`plannerNo`),
  KEY `FK_memberNo` (`memberNo`)
) ENGINE = InnoDB DEFAULT CHARSET = utf8;

--
-- 列出以下資料庫的數據： `planner`
--

INSERT INTO `planner` (`plannerNo`, `memberNo`) VALUES
(001, 001);

-- --------------------------------------------------------

--
-- 資料表格式： `wishing_pool`
--

CREATE TABLE IF NOT EXISTS `wishing_pool` (
  `wishNo` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `memberNo` int(3) unsigned zerofill NOT NULL,
  `w_area` varchar(255) NOT NULL,
  `w_date` date NOT NULL,
  `w_day` int(11) NOT NULL,
  `w_peopleNum` int(11) NOT NULL,
  `w_member` varchar(7) NOT NULL,
  `w_budget` int(11) NOT NULL,
  `w_remarks` varchar(255) NOT NULL,
  `cityName` varchar(255) NOT NULL,
  `category` varchar(255) NOT NULL,
  `w_endday` date NOT NULL,
  PRIMARY KEY (`wishNo`),
  KEY `FK_memberNo` (`memberNo`)
) ENGINE = InnoDB DEFAULT CHARSET = utf8;

--
-- 列出以下資料庫的數據： `wishing_pool`
--

INSERT INTO `wishing_pool` (`wishNo`, `memberNo`, `w_area`, `w_date`, `w_day`, `w_peopleNum`, `w_member`, `w_budget`, `w_remarks`, `cityName`, `category`, `w_endday`) VALUES
(4, 007, '4', '2017-05-13', 5, 2, '1,2,4', 50, '想在街上隨便找個路人，一同在雨中漫步<3', '墨爾本', '7,8', '2017-06-12'),
(5, 011, '5', '2017-10-20', 7, 7, '2,4', 120, '休閒的在市中心的草地上睡覺', '紐約', '3,6', '2017-11-19'),
(6, 012, '6', '2017-08-09', 9, 8, '1,4', 15000, '不用手機、電腦等3C產品，在樹屋過夜', '布宜諾斯艾利斯', '4,7,8', '2017-09-08'),
(7, 001, '7', '2017-11-24', 2, 2, '1', 6002, '我失戀了排什麼去哪吃什麼都可以，讓我能散心就好Q_Q', '隨便', '2,4,7', '2017-12-24'),
(8, 013, '2', '2017-01-18', 10, 4, '1,4', 100, '想住Camping車在野外生活一天', '倫敦', '1,4,7', '2017-02-17'),
(9, 003, '2', '2017-09-22', 5, 2, '3', 9000, '想看極光~~~~Please', '雷克雅維克', '6,8', '2017-10-22'),
(10, 004, '4', '2017-10-03', 2, 6, '2,3', 500, '坐直升機欣賞當地夜景', '休士頓', '2,3,4', '2017-11-02'),
(11, 015, '1', '2017-04-04', 1, 1, '1', 51, '拔掉當地最知名飯店總統套房的插座', '東京', '6,8', '2017-05-04'),
(12, 003, '1', '2017-07-05', 3, 1, '1,3', 209, '在當地當街頭藝人，帶給人們歡笑與希望', '泰國', '6,8', '2017-08-04'),
(14, 016, '3', '2017-05-02', 4, 7, '4', 633, '追逐龍捲風 !!', '盧旺達', '2,5,7,8', '2017-06-01'),
(16, 014, '5', '2017-09-22', 2, 2, '1', 466, '為自己種下一棵希望之樹', '雷昂', '2,4', '2017-05-04'),
(17, 017, '5', '2017-01-18', 5, 1, '2,3', 9527, '隨便挑一家賭場，投注10000元在賭博上', '蒙特雷', '1,7,8', '2017-02-17'),
(18, 008, '6', '2017-05-03', 3, 4, '1,3', 9487, '穿當地的服飾，和居民生活一星期', '厄瓜多爾', '4,8', '2017-06-02'),
(19, 010, '1', '2017-05-18', 2, 5, '4', 5566, '吃水果吃水果吃水果吃水果吃水果我要吃水果!!', '企鵝城', '1,3,4', '2017-06-17'),
(20, 018, '2', '2017-10-03', 1, 1, '3', 233, '不能逃不能逃不能逃不能逃不能逃不能逃', 'EVA', '6,8', '2017-11-02'),
(21, 019, '3', '2017-01-18', 1, 1, '2', 948, '想在死海游泳，呵呵~', 'LCL之海', '1,5,6,8', '2017-02-17'),
(22, 020, '4', '2017-10-03', 3, 3, '1', 51, '潑水節! 潑水節! 潑水節!', '清邁', '6', '2017-11-02'),
(23, 021, '6', '2017-05-02', 4, 2, '2', 666, '想住在金盞花大酒店思考人生的意義', '齋浦爾', '1,2,3', '2017-06-01'),
(24, 022, '5', '2017-09-22', 5, 1, '2', 999, '和阿爾一起見識真理之門 --by 矮豆', '亞美斯多利斯', '6,8', '2017-10-22'),
(25, 023, '6', '2017-10-03', 2, 10, '2', 670, '我想要在無邊無際的海洋上漂浮', '內之城', '2,8', '2017-11-02'),
(26, 024, '1', '2017-04-04', 1, 1, '2', 540, '我要當進擊的巨人!!', '諾德林根', '6,7', '2017-05-04'),
(27, 025, '2', '2017-10-03', 5, 8, '1,2', 320, '想當擅長旅遊的朋友=w=', '動物城', '1,3,4', '2017-11-02'),
(28, 026, '3', '2017-09-22', 1, 1, '2,3', 52, '出來吧! 召喚太陽神的翼神龍!!', '戰鬥城市', '2,3,4', '2017-10-22'),
(29, 027, '4', '2017-10-03', 6, 2, '2', 130, '想吃魔物美食030 <3', '迷宮飯', '5,7,8', '2017-11-02'),
(30, 028, '5', '2017-05-13', 1, 3, '1,2,3', 650, '千江有水千江月，萬里無雲萬里天', '桂花巷', '1,2,6', '2017-06-12'),
(31, 029, '6', '2017-10-03', 10, 1, '2', 830, '我要蒐集全世界的小倉鼠!!!', '毛茸茸城', '6,8', '2017-11-02'),
(32, 030, '7', '2017-04-11', 11, 4, '1,4', 566, '我要吃最高級的火鍋 = =+', '資策會', '4,5', '2017-05-11'),
(33, 016, '1', '2017-04-11', 5, 1, '2', 301, '請幫我安排能激發創作靈感的行程~~~', '亞美斯多利斯', '6,8', '2017-05-11'),
(34, 023, '2', '2017-01-18', 3, 2, '1,2', 999, '參加潛水社喝啤酒，過有意義的人生', 'Grand blue', '1,2,3', '2017-02-17'),
(35, 003, '3', '2017-05-03', 4, 3, '2', 6688, '生死去來，棚頭傀儡，一線斷時，落落磊磊', '攻殼機動隊', '3,4', '2017-06-02'),
(36, 021, '4', '2017-09-22', 5, 1, '3', 5566, 'Some men just want to watch the world burn', '高譚市', '5,8', '2017-10-22'),
(37, 031, '2', '2018-04-16', 17, 3, '3', 120, '想去參加啤酒節 <3 <3', '慕尼黑', '3,4,5', '2018-05-16'),
(38, 058, '6', '2018-10-20', 10, 4, '2', 1000, '從小就立志要去馬丘比丘、的的喀喀湖，拜託了QAQ <3 <3', '利馬', '2,3', '2018-11-20'),
(39, 060, '5', '2018-07-22', 8, 2, '1,3', 500, '想去看銀礦山城、馬雅文明、海明威故居', '墨西哥城', '1,3,6,8', '2018-08-22'),
(40, 031, '4', '2018-01-02', 10, 4, '1,4', 10, '去看看羊羊和廣闊的草原，享受緩慢的步調', '威靈頓', '4,5,7', '2018-02-02'),
(41, 012, '3', '2018-03-05', 2, 3, '4', 12000, '當然是金字塔啊~~', '開羅', '1,7,8', '2018-04-05'),
(42, 003, '1', '2018-06-06', 22, 4, '4', 800, '參觀千年的歷史文物，體會當地文化', '伊斯坦布爾', '3,6', '2018-07-06'),
(43, 014, '2', '2018-09-12', 8, 2, '3', 1000, '棉花般的雪白仙境，湛藍的溫泉，是我一生的嚮往', '代尼茲利', '1,2,5', '2018-10-12'),
(44, 079, '7', '2018-12-14', 15, 1, '4', 3000, '上PTT', '窩在旅館', '1,2,8,', '2018-01-14'),
(45, 056, '6', '2018-11-23', 9, 4, '3', 688, '去Museo Botero看世界級的藝術品', '哥倫比亞', '3,7', '2018-12-23'),
(46, 087, '5', '2018-08-27', 10, 5, '3', 4500, '去爭論一下楓糖漿倒底好不好吃', '多倫多', '1,3,6', '2018-09-27'),
(47, 003, '4', '2018-05-13', 4, 4, '1,2,3,4', 300, '好熱喔!! 想去浮淺', '帛琉', '2,5', '2018-06-14'),
(48, 043, '3', '2018-04-01', 3, 2, '1,2,3', 11000, '體驗伊斯蘭文化、藝術、歷史碰撞的古老韻味', '卡薩布蘭卡', '1,6,8', '2018-05-01'),
(49, 021, '2', '2018-02-24', 5, 1, '3', 948794, '據說葡萄牙的磁磚裝飾十分華麗，蛋塔也是其中一個原因啦嘿嘿', '波爾圖', '2,4,8', '2018-03-24'),
(50, 051, '1', '2018-01-15', 2, 2, '1,4', 5566, '非常想去嚮往已久的千年玫瑰古城佩特拉', '約旦', '1,2,3,4,6,8', '2018-02-15');

-- --------------------------------------------------------

--
-- 資料表格式： `report`
--

CREATE TABLE IF NOT EXISTS `report` (
  `wishReNo` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `memberNo` int(3) unsigned zerofill NOT NULL,
  `wishNo` int(11) NOT NULL,
  `wp_info` varchar(255) NOT NULL,
  PRIMARY KEY (`wishReNo`),
  KEY `FK_memberNo` (`memberNo`),
  KEY `FK_wishNo` (`wishNo`)
) ENGINE = InnoDB DEFAULT CHARSET = utf8;

--
-- 列出以下資料庫的數據： `report`
--

INSERT INTO `report` (`wishReNo`, `memberNo`, `wishNo`, `wp_info`) VALUES
(1, 001, 1, '內容為廣告/推銷訊息');
